Sainero/CubeProjectmodem/Cleanrykami/STM32CubeExpansion_LRWAN_V2.0.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
//BMP280_HandleTypedef bmp280;
BMP280_HandleTypedef bmp280;
//UART_HandleTypeDef huart2;
//RTC_HandleTypeDef hrtc;
//UART_HandleTypeDef husart2;
UART_HandleTypeDef husart1;
//I2C_HandleTypeDef hi2c1;
//SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2; ///// Для HTS если вдруг понадобится
//LPTIM_HandleTypeDef hlptim1;
union hts221_reg_t;
HTS221_Object_t hts221;
HTS221_Capabilities_t Capabilities;
//ADC_HandleTypeDef hadc1;
float pressure1, temperature1, humidity1;
int16_t pressureint, temperatureint, numberdev, per; modelnum, FirmwareVersion ;// номер устройста и период добавил
int32_t humidityint, temperaturei, humidityi, pressurei;
int16_t chargebattery = 0;

//int32_t temp_decimal = temperaturei % 100; // Получаем 2-ю цифру после запятой
/* USER CODE END PV */

/* Exported functions ---------------------------------------------------------*/
/* USER CODE BEGIN EF */
// MX_I2C1_Init();
//MX_I2C1_Init(hi2c1);
//MX_USART2_Init();
/* USER CODE END EF */

void LoRaWAN_Init(void)
{
	// UTIL_TIMER_Create(&RunLedTimer, 0xFFFFFFFFU, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL); //
	// UTIL_TIMER_SetPeriod(&RunLedTimer, 500); //
  /* USER CODE BEGIN LoRaWAN_Init_1 */
	/* bmp280_init_default_params(&bmp280.params);
	   	bmp280.addr = BMP280_I2C_ADDRESS_0;
	   	bmp280.i2c = &hi2c1;
*/
	   //float pressure1, temperature1, humidity1;
  /* USER CODE END LoRaWAN_Init_1 */
  LED_Init(LED_BLUE);
  LED_Init(LED_RED1);
  LED_Init(LED_RED2);

  /* Get LoRa APP version*/
//  APP_LOG(TS_OFF, VLEVEL_M, "APP_VERSION:        V%X.%X.%X\r\n",
//          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_MAIN_SHIFT),
//          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_SUB1_SHIFT),
//          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_SUB2_SHIFT));
  APP_LOG(TS_OFF, VLEVEL_M, "## Версия протокола:   V%X.%X.%X\r\n",
          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_SUB2_SHIFT)); // версия приложения (App)
  /* Get MW LoraWAN info */
//  APP_LOG(TS_OFF, VLEVEL_M, "MW_LORAWAN_VERSION: V%X.%X.%X\r\n",
//          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_MAIN_SHIFT),
//          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_SUB1_SHIFT),
//          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_SUB2_SHIFT));
//  APP_LOG(TS_OFF, VLEVEL_M, "MW_LORAWAN_VERSION: V%X.%X.%X\r\n",
//          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_MAIN_SHIFT),
//          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_SUB1_SHIFT),
//          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_SUB2_SHIFT)); // версию промежуточного программного обеспечения (Middleware)
  /* Get MW SubGhz_Phy info */
//  APP_LOG(TS_OFF, VLEVEL_M, "MW_RADIO_VERSION:   V%X.%X.%X\r\n",
//          (uint8_t)(__SUBGHZ_PHY_VERSION >> __APP_VERSION_MAIN_SHIFT),
//          (uint8_t)(__SUBGHZ_PHY_VERSION >> __APP_VERSION_SUB1_SHIFT),
//          (uint8_t)(__SUBGHZ_PHY_VERSION >> __APP_VERSION_SUB2_SHIFT)); // версия радио Middleware
  // APP_LOG(TS_OFF, VLEVEL_M, "MW_:   V%X.%X.%X\r\n",
//  APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ==== EEEPROM EST====\r\n");
  //	 (uint8_t) buffer[20]);
  UTIL_TIMER_Create(&TxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerLedEvent, NULL);
  // HAL_LPTIM_Counter_Start_IT(&hlptim,1000);
 // HAL_LPTIM_TimeOut_Start(&TxLedTimer, uint32_t Period, uint32_t Timeout);
  //  HAL_LPTIM_TimeOut_Start(&TxLedTimer,5000,1000);
   UTIL_TIMER_Create(&RxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
  UTIL_TIMER_Create(&JoinLedTimer, 0xFFFFFFFFU, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);
  UTIL_TIMER_SetPeriod(&TxLedTimer, 500);// 3 стр отрубают светодиоды если их не будет,
  UTIL_TIMER_SetPeriod(&RxLedTimer, 500);
  UTIL_TIMER_SetPeriod(&JoinLedTimer, 500);
 // bmp280_read_float(&bmp280, &temperature1, &pressure1, &humidity1);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU, LmHandlerProcess);  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), UTIL_SEQ_RFU, SendTxData);
  /* Init Info table used by LmHandler*/
  LoraInfo_Init();
  /* Init the Lora Stack*/
  LmHandlerInit(&LmHandlerCallbacks);

  LmHandlerConfigure(&LmHandlerParams);

  UTIL_TIMER_Start(&JoinLedTimer);
  // HAL_LPTIM_Counter_Start_IT(&JoinLedTimer,1000); // попытка переделать светодиодом под LPTIM
  LmHandlerJoin(ActivationType);

  if (EventType == TX_ON_TIMER)
  {
    /* send every time timer elapses */
 uint32_t APPTXDUTYCYCLE; // Для конфигурации периода передачи только нужно добавить в EEPROM
 APPTXDUTYCYCLE = 10000; // Для конфигурации периода передачи
    UTIL_TIMER_Create(&TxTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
//    UTIL_TIMER_SetPeriod(&TxTimer,  APP_TX_DUTYCYCLE);
    UTIL_TIMER_SetPeriod(&TxTimer,  APPTXDUTYCYCLE);
    //  HAL_PWR_EnterSLEEPMode(PWR_LOWPOWERREGULATOR_ON, PWR_SLEEPENTRY_WFI);
    //  HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);
    //HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI); // NEW
      UTIL_TIMER_Start(&TxTimer);

    // UTIL_TIMER_Stop(&TxTimer); // такой же трай для одиночного сообщения
    //  HAL_LPTIM_Counter_Start_IT(&TxTimer,1000);
  }
  else
  {
    /* send every time button is pushed */
    BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);
  }
  /* USER CODE BEGIN LoRaWAN_Init_Last */
 // MX_USART2_Init();
 // MX_I2C1_Init();
  /* bmp280_init_default_params(&bmp280.params);
   	bmp280.addr = BMP280_I2C_ADDRESS_0;
   	bmp280.i2c = &hi2c1;
   	*/
  /* USER CODE END LoRaWAN_Init_Last */
}
/*void LoRaWANWD_Init(void)
{

  /* USER CODE BEGIN LoRaWAN_Init_1 */
	/* bmp280_init_default_params(&bmp280.params);
	   	bmp280.addr = BMP280_I2C_ADDRESS_0;

	   	bmp280.i2c = &hi2c1;gjk
*/
	//HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);
	   //float pressure1, temperature1, humidity1; ЗДЕСЬ РОДИТСЯ СТОРОЖ? а может и не надо
  /* USER CODE END LoRaWAN_Init_1 */

  /* Get LoRa APP version*/


