Sainero/CubeProjectmodem/Cleanrykami/STM32CubeExpansion_LRWAN_V2.0.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
    	} //*/
    	 else
    	 {

//    		 APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ==== Sensor initialization failed ====\r\n");
//    		 APP_LOG(TS_OFF, VLEVEL_M, "  Ошибка инициализации датчика   \r\n");
    		 APP_LOG(TS_OFF, VLEVEL_M, "     Датчик измерения : ошибка инициализации    \r\n");
    	 }

    	 if(temperaturei/100>=1 && temperaturei/100<=30)
//    		 if(temperature1>=1 && temperature1<=30 && pressure1>=1)
    	     	//*/
    	  {
//    	     	  APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ==== All parameters normal ====\r\n");
    	     	  APP_LOG(TS_OFF, VLEVEL_M, "     Параметры окружающей среды: в норме \r\n");
    	  } //*/
    	     	 else
    	   {
//    	     		 APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ==== Accident ====\r\n");
//    	       		 APP_LOG(TS_OFF, VLEVEL_M, "    Отклонение от нормы > \r\n");
    	       		 APP_LOG(TS_OFF, VLEVEL_M, "     Параметры окружающей среды: отклонение от нормы \r\n");
    	   }
    	 modelnum = 1;
    	 // EEPROMWRITE modelnum
    	 numberdev = 0x01;  // new 0b00010001
    	 per = 0xA; // new
         FirmwareVersion = 1.1;

  // bool bme280p = bmp280.id == BME280_CHIP_ID;
 // size = (temperature1, pressure1, humidity1);
//    size = (temperature1, pressure1, humidity1);
//    size = sprintf((char *)Data, "Sensor initialization failed\n");

    //    size = (Capabilities);
    // size = sprintf((char *)Data,
    //	  					"%d:%d:%d\n", (int)temperature,(int)pressure,(int)humidity);
    // printf("IDDDDDDDDDDD 2\n\r");
    //snprintf("IDDDDDDDDDDD 2\n\r");
    // vprintf(size);
    // putchar("IDDDDDDDDDDD 2\n\r");
    // HAL_ADC_Start(&hadc1); // запускаем преобразование сигнала АЦП
    // adc = HAL_ADC_GetValue(&hadc1); // читаем полученное значение в переменную adc
    //	HAL_ADC_Stop(&hadc1); // останавливаем АЦП (не обязательно)
    //   HAL_UART_Transmit(&husart1, Data, size, 1000);
    // HAL_UART_Transmit(&husart1, Data, size, 1000);'
    // HAL_UART_Transmit_DMA(&husart1, Daata, size, 1000);
    // HAL_UART_Transmit_DMA(&husart1, Daata, size, 1000);
    //   HAL_Delay(200);

  // HAL_I2C_Master_Receive(&hi2c1, size);
  //  bmp280_read_float(&bme280p, &temperature1, &pressure1, &humidity1);
    //dev
 // LmHandlerAppData_t *appData, LmHandlerRxParams_t *params):
  // for i = setbuf(AppData.Buffer, 51);
  // AppData.Buffer[i++] = temperature1;// 1  варик
  // AppData.Buffer[i++] = ((pressure1 >> 8) & 0xFF);
  // AppData.Buffer[i++] = 0x02;
  // for (i = 0; i <= 50; i++)  ||Cчётчик
  // pressure1 = (uint16_t)(params.oversampling_pressure * 10);

    //    AppData.Buffer[i++] = ((pressure1 >> 8) & 0xFF);
    // humidity1 = (uint16_t)(params.oversampling_humidity * 10);
    // humidity1 = (uint16_t)(bmp280_params_t).oversampling_humidity * 10;
    // humidity1 = (uint16_t)(params.oversampling_humidity * 10);
    // pressure1 = (uint16_t)(params.oversampling_pressure * 10);
    //temperature1 = (uint16_t)(params.oversampling_temperature * 10);
  // temperature1 = 0x02;
  // AppData.Buffer[i++] = (uint16_t)pressure1 >> 1 ;
  // AppData.Buffer[i++] = (uint8_t)temperature1 >> 8 ;
  //  AppData.Buffer[i++] = (int)humidity1 >> 16;


    //AppData.Buffer[i++] = 0x00;
     AppData.Buffer[i++] = numberdev; // new номер устройства
//     AppData.Buffer[i++] = temperaturei;
//     AppData.Buffer[i++] = temperaturei / 100;
     AppData.Buffer[i++] = (temperaturei / 100) % 100;
     AppData.Buffer[i++] = humidityi/1000;

     AppData.Buffer[i++] = per; // new период включения прибора
//     temperatureint = temperature1;
//     humidityint = humidity1;
      // AppData.Buffer[i++] = BAT_CR2032; // new заряд батареи, CR2032 старая батарейка, новая LS14500
  // SYS_GetBatteryLevel(); // new заряд батареи
     chargebattery = GetBatteryLevel(); // new заряд батареи
  // AppData.Buffer[i++] = batteryLevel; // new заряд батареи
     AppData.Buffer[i++] = chargebattery;
//     HAL_Delay(1000);
//     APP_LOG(TS_OFF, VLEVEL_M, " Номер модема:%d | Температура:%d | Влажность:%d | Период передачи:%d сек | Заряд батареи:%d%\r\n",
//       		numberdev, temperatureint, humidityint, per, chargebattery);
//     APP_LOG(TS_OFF, VLEVEL_M, "Заряд батареи:%d\r\n", chargebattery);
     HAL_Delay(200);

//		 APP_LOG(TS_OFF, VLEVEL_M, "     Номер устройства:%d | Температура:%d,%02d °C | Влажность:%d%  | Период передачи:%d сек | Заряд батареи:%d%\r\n",
//	  numberdev, temperaturei / 100, temp_decimal, humidityi /1000, per, chargebattery);
		 APP_LOG(TS_OFF, VLEVEL_M, "     Номер устройства: %d | Температура воздуха: %d,%02d °C | Влажность воздуха: %d%\r\n",
		  numberdev, temperaturei / 100, temp_decimal, humidityi /1000);
		 APP_LOG(TS_OFF, VLEVEL_M, "     Период передачи: %d сек | Заряд батареи: %d%\r\n", per, chargebattery);
//     APP_LOG(TS_OFF, VLEVEL_M, "%d | %d | %d\r\n",
//            		 sizeof(temperature1), sizeof(AppLedStateOn), sizeof(chargebattery));
//     OnTxData(numberdev, temperature1, humidity1, per, chargebattery);
  // AppData.Buffer[i++] = Capabilities;
  //AppData.Buffer[i++] = SYS_GetTemperatureLevel(); °C
  // AppData.Buffer[i++] = HAL_ADC_GetState; //  09 что значит
  // AppData.Buffer[i++] = size;
  // AppData.Buffer[i] = Snr;
  // AppData.Buffer[i++] = 0x02;
  //  AppData.Buffer[i++] = cnt; // new период включения прибора
  /* */   // AppData.Buffer[i++] = Capabilities;
  // AppData.Buffer[i] = i;  ||Cчётчик

  // AppData.Buffer[i++] = '\0';

  // HAL_LPTIM_Counter_Start_IT(&hlptim1,10000);
  //HAL_LPTIM_Counter_Start_IT(&hlptim1,1000);

  // HAL_LPTIM_Encoder_Start(&hlptim1,1000); не считает не в какую сторону

 // AppData.Buffer[i++] = (uint8_t)((humidity >> 8) & 0xFF);
 // AppData.Buffer[i++] = (uint8_t)(humidity & 0xFF);

  /*     if ((LmHandlerParams.ActiveRegion == LORAMAC_REGION_US915) || (LmHandlerParams.ActiveRegion == LORAMAC_REGION_AU915)
      || (LmHandlerParams.ActiveRegion == LORAMAC_REGION_AS923))
  {
    AppData.Buffer[i++] = 0;
    AppData.Buffer[i++] = 0;
    AppData.Buffer[i++] = 0;
    AppData.Buffer[i++] = 0;
  }
  else
  {
    latitude = sensor_data.latitude;
    longitude = sensor_data.longitude;

    AppData.Buffer[i++] = GetBatteryLevel();        // 1 (very low) to 254 (fully charged)
    AppData.Buffer[i++] = (uint8_t)((latitude >> 16) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)((latitude >> 8) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)(latitude & 0xFF);
    AppData.Buffer[i++] = (uint8_t)((longitude >> 16) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)((longitude >> 8) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)(longitude & 0xFF);
    AppData.Buffer[i++] = (uint8_t)((altitudeGps >> 8) & 0xFF);
    AppData.Buffer[i++] = (uint8_t)(altitudeGps & 0xFF);

