Sainero/CubeProjectmodem/Cleanrykami/STM32CubeExpansion_LRWAN_V2.0.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
  /* USER CODE BEGIN LPTIM1_Init 0 */

  /* USER CODE END LPTIM1_Init 0 */

  /* USER CODE BEGIN LPTIM1_Init 1 */

  /* USER CODE END LPTIM1_Init 1 */
//	  hlptim1.Instance = LPTIM1;
//	  hlptim1.Init.Clock.Source = LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC;
//	  hlptim1.Init.Clock.Prescaler = LPTIM_PRESCALER_DIV1;
//	  hlptim1.Init.UltraLowPowerClock.Polarity = LPTIM_CLOCKPOLARITY_RISING;
//	  hlptim1.Init.UltraLowPowerClock.SampleTime = LPTIM_CLOCKSAMPLETIME_DIRECTTRANSITION;
//	  hlptim1.Init.Trigger.Source = LPTIM_TRIGSOURCE_SOFTWARE;
//	  hlptim1.Init.OutputPolarity = LPTIM_OUTPUTPOLARITY_HIGH;
//	  hlptim1.Init.UpdateMode = LPTIM_UPDATE_IMMEDIATE;
//	  hlptim1.Init.CounterSource = LPTIM_COUNTERSOURCE_EXTERNAL;
//  if (HAL_LPTIM_Init(&hlptim1) != HAL_OK)
//  {
//    Error_Handler();
//  }
  /*
  /* USER CODE BEGIN LPTIM1_Init 2 */

  /* USER CODE END LPTIM1_Init 2 */

}
//  void HAL_LPTIM_MspInit(LPTIM_HandleTypeDef* hlptim)
//  {
//    GPIO_InitTypeDef GPIO_InitStruct = {0};
//    if(hlptim->Instance==LPTIM1)
//    {
//    /* USER CODE BEGIN LPTIM1_MspInit 0 */
//
//    /* USER CODE END LPTIM1_MspInit 0 */
//      /* Peripheral clock enable */
//      __HAL_RCC_LPTIM1_CLK_ENABLE();
//
//      __HAL_RCC_GPIOB_CLK_ENABLE();
      /**LPTIM1 GPIO Configuration
      PB5     ------> LPTIM1_IN1
      PB7     ------> LPTIM1_IN2
      */
//      GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_7;
//      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
//      GPIO_InitStruct.Pull = GPIO_NOPULL;
//      GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//      GPIO_InitStruct.Alternate = GPIO_AF2_LPTIM1;
//      HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
//
//      /* LPTIM1 interrupt Init */
//      HAL_NVIC_SetPriority(LPTIM1_IRQn, 0, 0);
//      HAL_NVIC_EnableIRQ(LPTIM1_IRQn);
    /* USER CODE BEGIN LPTIM1_MspInit 1 */

    /* USER CODE END LPTIM1_MspInit 1 */
//    }
//
//  }

  /**
  * @brief LPTIM MSP De-Initialization
  * This function freeze the hardware resources used in this example
  * @param hlptim: LPTIM handle pointer
  * @retval None
  */
//  void HAL_LPTIM_MspDeInit(LPTIM_HandleTypeDef* hlptim)
//  {
//    if(hlptim->Instance==LPTIM1)
//    {
//    /* USER CODE BEGIN LPTIM1_MspDeInit 0 */
//
//    /* USER CODE END LPTIM1_MspDeInit 0 */
//      /* Peripheral clock disable */
//      __HAL_RCC_LPTIM1_CLK_DISABLE();
//
//      /**LPTIM1 GPIO Configuration
//      PB5     ------> LPTIM1_IN1
//      PB7     ------> LPTIM1_IN2
//      */
//      HAL_GPIO_DeInit(GPIOB, GPIO_PIN_5|GPIO_PIN_7);
//
//      /* LPTIM1 interrupt DeInit */
//      HAL_NVIC_DisableIRQ(LPTIM1_IRQn);
//    /* USER CODE BEGIN LPTIM1_MspDeInit 1 */
//
//    /* USER CODE END LPTIM1_MspDeInit 1 */
//    }
//
//  }

static void OnMacProcessNotify(void)
{
  /* USER CODE BEGIN OnMacProcessNotify_1 */

  /* USER CODE END OnMacProcessNotify_1 */
  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LmHandlerProcess), CFG_SEQ_Prio_0);
  /* USER CODE BEGIN OnMacProcessNotify_2 */

  /* USER CODE END OnMacProcessNotify_2 */
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

